Catalogs/абс_Регионы/абс_Регионы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_Регионы</name>
  <comment>Регионы</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАдресногоЭлемента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖДСтанцияНазначения</name>
    <comment>Железнодорожная станция назначения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодРегионаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

InformationRegisters/АдресныйКлассификатор/АдресныйКлассификатор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АдресныйКлассификатор</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>52</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АльтернативныеНазвания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипАдресногоЭлемента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодРегионаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодРайонаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодГородаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодНаселенногоПунктаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУлицыВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Код</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Catalogs/абс_Регионы/ManagerModule.bsl
//АБС ВСТАВКА 37010  26.12.2013 17:36:13  Фролов
Процедура ЗаполнитьПоКлассификаторуАдресов() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	АдресныйКлассификатор.КодРегионаВКоде КАК КодРегиона,
	|	АдресныйКлассификатор.Наименование,
	|	АдресныйКлассификатор.Сокращение,
	|	абс_Регионы.Ссылка КАК РегионСсылка,
	|	АдресныйКлассификатор.КодРегионаВКоде КАК абс_КодРегионаВКоде
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.абс_Регионы КАК абс_Регионы
	|		ПО АдресныйКлассификатор.КодРегионаВКоде = абс_Регионы.абс_КодРегионаВКоде
	|ГДЕ
	|	АдресныйКлассификатор.КодРайонаВКоде = 0
	|	И АдресныйКлассификатор.КодГородаВКоде = 0
	|	И АдресныйКлассификатор.КодНаселенногоПунктаВКоде = 0
	|	И АдресныйКлассификатор.КодУлицыВКоде = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодРегиона"); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СоздатьОбновитьРегион(Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОбновитьРегион(ДанныеПоРегиону) Экспорт
	
	РегионОбъект = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеПоРегиону.РегионСсылка) Тогда		
		РегионОбъект = ДанныеПоРегиону.РегионСсылка.ПолучитьОбъект();
	Иначе
		РегионОбъект = Справочники.абс_Регионы.СоздатьЭлемент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РегионОбъект, ДанныеПоРегиону);	
	
	РегионОбъект.ОбменДанными = Истина;
	
	РегионОбъект.Записать();
	
	ОбщегоНазначения.СообщитьИнформациюПользователю("Регион """ + ДанныеПоРегиону.Наименование + """ " + ?(ЗначениеЗаполнено(ДанныеПоРегиону.РегионСсылка), "обновлен", "создан") + "!");
	
	Возврат РегионОбъект.Ссылка;
	
КонецФункции
//АБС ВСТАВКА 37010 КОНЕЦ
